WSDL/BookQuoteWS.xml

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="BookQuoteWS"
  targetNamespace="http://www.Monson-Haefel.com/jwsbook/BookQuote"
  xmlns:mh="http://www.Monson-Haefel.com/jwsbook/BookQuote"
  xmlns:soapbind="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns="http://schemas.xmlsoap.org/wsdl/">
  <!-- message elements describe the input and output parameters -->
  <message name="GetBookPriceRequest">
    <part name="isbn" type="xsd:string" />
  </message>
  <message name="GetBookPriceResponse">
    <part name="price" type="xsd:float" />
  </message>
  <!-- portType element describes the abstract interface of a Web se
  <portType name="BookQuote">
    <operation name="getBookPrice">
      <input name="isbn" message="mh:GetBookPriceRequest"/>
      <output name="price" message="mh:GetBookPriceResponse"/>
    </operation>
  </portType>
<!-- binding tells us which protocols and encoding styles are used
<binding name="BookPrice_Binding" type="mh:BookQuote">
  <soapbind:binding style="rpc"
  transport="http://schemas.xmlsoap.org/soap/http"/>
  <operation name="getBookPrice">
  <soapbind:operation style="rpc"
  soapAction=
  "http://www.Monson-Haefel.com/jwsbook/BookQuote/GetBookPrice"
    <input>
      <soapbind:body use="literal"
      namespace="http://www.Monson-Haefel.com/jwsbook/BookQuote
    </input>
    <output>
    <soapbind:body use="literal"
      namespace="http://www.Monson-Haefel.com/jwsbook/BookQuote
    </output>
  </operation>
</binding>
<!-- service tells us the Internet address of a Web service -->
<service name="BookPriceService">
  <port name="BookPrice_Port" binding="mh:BookPrice_Binding">
    <soapbind:address location=
    "http://www.Monson-Haefel.com/jwsbook/BookQuote" />
  </port>
</service>
</definitions>
