trunk/WebServices/J2EE_WEB_SERVICES/src/main/java/com/jaxp/examples/BookQuote.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:mh="http://www.Monson-Haefel.com/jwsbook/BookQuote">
    <soap:Body>
        <mh:getBookPrice>
            <isbn xsi:type="xsd:string">0321146182</isbn>
        </mh:getBookPrice>
    </soap:Body>
</soap:Envelope>